## Learn Pandas

In [34]:
import numpy as np
import pandas as pd

In [35]:
pd.Series(data = [1,2,3,4,5], index = ['a','b','c','d','e'])

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [36]:
dict = {'1':7, '2':4, 'h':5}

In [37]:
dict

{'1': 7, '2': 4, 'h': 5}

In [38]:
pd.Series(dict)

1    7
2    4
h    5
dtype: int64

In [39]:
mySeriesOne = pd.Series([1,2,3,4,5], ['a', 'b', 'c', 'd', 'e'])

In [40]:
mySeriesTwo = pd.Series([1,2,7,4,2], ['a', 'b', 'c', 'f', 'e'])

In [41]:
mySeriesOne + mySeriesTwo

a     2.0
b     4.0
c    10.0
d     NaN
e     7.0
f     NaN
dtype: float64

In [42]:
from numpy.random import randn

In [43]:
myData = randn(3,4)

In [44]:
myData

array([[-0.6357042 ,  1.51320317,  0.16077583, -0.54056535],
       [ 0.20430335,  0.51641997,  0.22293326, -1.04654256],
       [-0.49610362,  0.01423287, -0.11136195,  1.39760619]])

In [45]:
myDataFrame = pd.DataFrame(myData, ['R1','R2','R3'], ['C1', 'C2', 'C3','C4'])

In [46]:
myDataFrame

          C1        C2        C3        C4
R1 -0.635704  1.513203  0.160776 -0.540565
R2  0.204303  0.516420  0.222933 -1.046543
R3 -0.496104  0.014233 -0.111362  1.397606

In [47]:
myDataFrame['C1']

R1   -0.635704
R2    0.204303
R3   -0.496104
Name: C1, dtype: float64

In [48]:
myDataFrame ['C5']  = myDataFrame['C1']* myDataFrame['C3']

In [49]:
myDataFrame

          C1        C2        C3        C4        C5
R1 -0.635704  1.513203  0.160776 -0.540565 -0.102206
R2  0.204303  0.516420  0.222933 -1.046543  0.045546
R3 -0.496104  0.014233 -0.111362  1.397606  0.055247

In [50]:
myDataFrame['C1']

R1   -0.635704
R2    0.204303
R3   -0.496104
Name: C1, dtype: float64

In [51]:
myDataFrame.drop('C2', axis=1, inplace=True)

In [52]:
myDataFrame

          C1        C3        C4        C5
R1 -0.635704  0.160776 -0.540565 -0.102206
R2  0.204303  0.222933 -1.046543  0.045546
R3 -0.496104 -0.111362  1.397606  0.055247

In [53]:
myDataFrame.loc['R1']

C1   -0.635704
C3    0.160776
C4   -0.540565
C5   -0.102206
Name: R1, dtype: float64

In [54]:
dict

{'1': 7, '2': 4, 'h': 5}

In [55]:
myDict = pd.Series(dict)

In [56]:
myDict

1    7
2    4
h    5
dtype: int64

In [57]:
myDict

1    7
2    4
h    5
dtype: int64

In [58]:
#DictFrame = pd.DataFrame(dict)

In [59]:
myDataFrame.loc[['R1','R2'], ['C4', 'C5']]

          C4        C5
R1 -0.540565 -0.102206
R2 -1.046543  0.045546

In [60]:
myDataFrame

          C1        C3        C4        C5
R1 -0.635704  0.160776 -0.540565 -0.102206
R2  0.204303  0.222933 -1.046543  0.045546
R3 -0.496104 -0.111362  1.397606  0.055247

In [61]:
myDataFrame.loc[['R2','R3'], ['C1', 'C3']]

          C1        C3
R2  0.204303  0.222933
R3 -0.496104 -0.111362

In [62]:
myDataFrame >0

       C1     C3     C4     C5
R1  False   True  False  False
R2   True   True  False   True
R3  False  False   True   True

In [63]:
myDataFrame[myDataFrame > 0]

          C1        C3        C4        C5
R1       NaN  0.160776       NaN       NaN
R2  0.204303  0.222933       NaN  0.045546
R3       NaN       NaN  1.397606  0.055247

In [64]:
myDataFrame [myDataFrame['C3']>0]

          C1        C3        C4        C5
R1 -0.635704  0.160776 -0.540565 -0.102206
R2  0.204303  0.222933 -1.046543  0.045546

In [65]:
myDataFrame[myDataFrame['C5']>0]

          C1        C3        C4        C5
R2  0.204303  0.222933 -1.046543  0.045546
R3 -0.496104 -0.111362  1.397606  0.055247

In [66]:
myDataFrame [(myDataFrame['C3']>0) & (myDataFrame['C4']>0)]

Empty DataFrame
Columns: [C1, C3, C4, C5]
Index: []

In [67]:
myDataFrame['NewIndex'] = ['row1','row2','row3']

In [68]:
myDataFrame.set_index('NewIndex')

                C1        C3        C4        C5
NewIndex
row1     -0.635704  0.160776 -0.540565 -0.102206
row2      0.204303  0.222933 -1.046543  0.045546
row3     -0.496104 -0.111362  1.397606  0.055247

In [69]:
myDataFrame.columns = ['a', 'b', 'c','d','e']

In [70]:
myDataFrame

           a         b         c         d     e
R1 -0.635704  0.160776 -0.540565 -0.102206  row1
R2  0.204303  0.222933 -1.046543  0.045546  row2
R3 -0.496104 -0.111362  1.397606  0.055247  row3

In [71]:
myDataFrame.rename( columns = {'a':1, 'b':2},index = {'R1':1}, inplace = True)

In [72]:
myDataFrame

           1         2         c         d     e
1  -0.635704  0.160776 -0.540565 -0.102206  row1
R2  0.204303  0.222933 -1.046543  0.045546  row2
R3 -0.496104 -0.111362  1.397606  0.055247  row3

In [82]:
dictionary = {'one':[1], 'two':[4], 'three':[7]}

In [83]:
dictionary

{'one': [1], 'two': [4], 'three': [7]}

In [84]:
dictDataFrame = pd.DataFrame(dictionary)

In [85]:
dictDataFrame

   one  two  three
0    1    4      7